-> intro

=== intro ===

// Повествование

Жил-был в густом лесу маленький медвежонок по имени Топтыжка. Он был совсем юным, но в его сердечке жила огромная тяга к приключениям и желание помогать всем вокруг. Однажды, гуляя по лесу, Топтыжка услышал жалобный писк...

Начало истории:

#Location: Изображение Топтыжки, миловидного медвежонка, стоящего на лесной опушке. Слышен тихий писк.

"Ох, что это за звук? Кажется, кто-то попал в беду"

Варианты действий:

+ Пойти на звук. -> A 

+ Посмотреть, нет ли опасности. -> B

+ Не обращать внимания и пойти дальше. -> C   

=== A ===

#Location: Спасение бабочки

Топтыжка находит бабочку с подраненным крылом, запутавшуюся в паутине

Топтыжка осторожно пошёл на звук и увидел... маленькую бабочку! Она запуталась в паутине и отчаянно пыталась вырваться."


Варианты действий:

+ Попробовать освободить бабочку, рискуя попасть в паутину. -> D

+ Позвать на помощь маму-медведицу. -> F1

+ Уйти, ведь паутина опасна. -> B

=== D ===

#Location: Освобождение бабочки

Топтыжка осторожно распутывает паутину, стараясь не навредить бабочке.

"Топтыжка осторожно начал распутывать паутину. Он старался быть очень аккуратным, чтобы не повредить крылышко бабочки. Паук, увидев это, злобно зашипел из-за кустов..."

Варианты действий:

+ Поскорее освободить бабочку. -> F

+ Постараться поговорить с пауком, объяснив ему, что бабочка не виновата. -> F1

+ Начать плакать и звать маму. -> B

=== F ===

Благодарность бабочки и знакомство

Топтыжка освобождает бабочку. Бабочка благодарно кружит вокруг него.

"Наконец, бабочка была свободна! Она радостно закружилась вокруг Топтыжки, благодаря его за спасение. 

Спасибо тебе, добрый медвежонок! Я - Лилия, и теперь ты мой друг!

Варианты действий:

+ Попрощаться с Лилией и пойти дальше. -> C

+ Спросить Лилию, не нужно ли ей помочь еще чем-нибудь. -> T

+ Забыть о Лилии и начать искать что-нибудь вкусное для перекуса. -> F1

=== T ===

#Location: Встреча с белкой

Топтыжка и Лилия гуляют по лесу. Они видят белку, застрявшую в дупле дерева.

Она отчаянно пыталась выбраться, но у нее ничего не получалось.

Варианты действий:

+ Попытаться вытащить белку из дупла. -> F1

+ Позвать на помощь дятла, чтобы он расширил дупло. -> Q

+ Пожалеть белку и пойти дальше, ведь помочь все равно не получится. -> C 

=== Q ===

#Location: Помощь дятла  

Топтыжка и Лилия нашли дятла. Они рассказали ему о беде белки, и дятел согласился помочь! Он принялся долбить дерево своим клювом, расширяя дупло.

Варианты действий:

+ Подождать, пока дятел закончит работу. -> N

+ Попытаться помочь дятлу, держа его за лапку. -> F1

+ Уйти, чтобы не мешать дятлу. -> C

=== N ===

#Location: Освобождение белки и дружба

Белка вылезает из дупла, потирая бок. Дятел довольно смотрит на результат работы.

Белка с трудом выбралась из дупла и радостно запрыгала по веткам. 'Спасибо вам всем! Меня зовут Рыжик, и я буду вашим другом!'

Варианты действий:

+ Попрощаться с Рыжиком и дятлом и пойти дальше. -> C

+ Попросить Рыжика показать, где можно найти вкусные орешки. -> J

+ Похвалить дятла за отличную работу и пойти искать маму-медведицу. -> C

=== J ===

#Location: Спасение зайчонка

Топтыжка, Лилия и Рыжик отправились на поиски орешков. Вдруг они услышали плач. Это был маленький зайчонок, который попал в ловушкe, расставленную охотником!

Варианты действий:

+ Попытаться освободить зайчонка из ловушки. -> U

+ Позвать на помощь маму-медведицу и других зверей. -> F1

+ Испугаться и убежать, оставив зайчонка одного. -> B

=== U ===

#Location: Освобождение зайчонка

Топтыжка осторожно подошел к ловушке. Она была очень опасной! Нужно было быть предельно осторожным, чтобы не пораниться и освободить зайчонка.

Варианты действий:

+ Попробовать разжать ловушку лапами. -> F1

+ Попытаться подпилить ловушку зубами. -> F1

+ Позвать на помощь Рыжика, чтобы он помог разжать ловушку. -> H

=== H ===

#Location: Освобождение зайчонка 

Рыжик, используя свою силу и ловкость, помог разжать ловушку. Топтыжка осторожно вытащил зайчонка, который был очень напуган.

Варианты действий:

+ Успокоить зайчонка и спросить, как его зовут. -> A1

+ Поскорее убежать от этого места, пока не пришел охотник. -> B

+ Начать хвалить себя за спасение зайчонка, забыв о нем. -> C

=== A1 ===

#Loction: Благодарность зайчонка и большая дружба

Зайчонок, Рыжик, Лилия и Топтыжка стоят вместе, улыбаясь.

Зайчонок, которого звали Пушистик, был очень рад, что его спасли. 'Спасибо вам всем! Вы настоящие друзья!' 

С тех пор Топтыжка, Лилия, Рыжик и Пушистик стали неразлучными друзьями. Они вместе играли, помогали друг другу и всегда приходили на помощь в трудную минуту. -> END

=== B ===

#Location: Медвежонок убегает

Испугавшись, медвежонок убегает -> END

=== C ===

#Location: Мишка уходит маме 

Медвежонок решил уйти домой -> END

=== F1 ===

#Location: Медвежонок уходит

После неудачной попытки медвежонок решил позвать на помощь маму -> END 



